# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write complex queries
* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [3]:
#Your code here; import the necessary packages
import sqlite3

In [4]:
#Your code here; create the connection and cursor
conn = sqlite3.connect('data.sqlite')
curr = conn.cursor()

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [3]:
#Your code here; use a subquery. No join will be necessary.
curr.execute('''SELECT customernumber, contactlastname, contactfirstname FROM customers WHERE
                (SELECT orderdate FROM orders WHERE orderdate = '2003-01-31');''')
curr.fetchall()

[('103', 'Schmitt', 'Carine '),
 ('112', 'King', 'Jean'),
 ('114', 'Ferguson', 'Peter'),
 ('119', 'Labrune', 'Janine '),
 ('121', 'Bergulfsen', 'Jonas '),
 ('124', 'Nelson', 'Susan'),
 ('125', 'Piestrzeniewicz', 'Zbyszek '),
 ('128', 'Keitel', 'Roland'),
 ('129', 'Murphy', 'Julie'),
 ('131', 'Lee', 'Kwai'),
 ('141', 'Freyre', 'Diego '),
 ('144', 'Berglund', 'Christina '),
 ('145', 'Petersen', 'Jytte '),
 ('146', 'Saveley', 'Mary '),
 ('148', 'Natividad', 'Eric'),
 ('151', 'Young', 'Jeff'),
 ('157', 'Leong', 'Kelvin'),
 ('161', 'Hashimoto', 'Juri'),
 ('166', 'Victorino', 'Wendy'),
 ('167', 'Oeztan', 'Veysel'),
 ('168', 'Franco', 'Keith'),
 ('169', 'de Castro', 'Isabel '),
 ('171', 'Rancé', 'Martine '),
 ('172', 'Bertrand', 'Marie'),
 ('173', 'Tseng', 'Jerry'),
 ('175', 'King', 'Julie'),
 ('177', 'Kentary', 'Mory'),
 ('181', 'Frick', 'Michael'),
 ('186', 'Karttunen', 'Matti'),
 ('187', 'Ashworth', 'Rachel'),
 ('189', 'Cassidy', 'Dean'),
 ('198', 'Taylor', 'Leslie'),
 ('201', 'Devon', 'Elizabeth'),
 ('202', 'Tamuri', 'Yoshi '),
 ('204', 'Barajas', 'Miguel'),
 ('205', 'Young', 'Julie'),
 ('206', 'Walker', 'Brydey'),
 ('209', 'Citeaux', 'Frédérique '),
 ('211', 'Gao', 'Mike'),
 ('216', 'Saavedra', 'Eduardo '),
 ('219', 'Young', 'Mary'),
 ('223', 'Kloss', 'Horst '),
 ('227', 'Ibsen', 'Palle'),
 ('233', 'Fresnière', 'Jean '),
 ('237', 'Camino', 'Alejandra '),
 ('239', 'Thompson', 'Valarie'),
 ('240', 'Bennett', 'Helen '),
 ('242', 'Roulet', 'Annette '),
 ('247', 'Messner', 'Renate '),
 ('249', 'Accorti', 'Paolo '),
 ('250', 'Da Silva', 'Daniel'),
 ('256', 'Tonini', 'Daniel '),
 ('259', 'Pfalzheim', 'Henriette '),
 ('260', 'Lincoln', 'Elizabeth '),
 ('273', 'Franken', 'Peter '),
 ('276', "O'Hara", 'Anna'),
 ('278', 'Rovelli', 'Giovanni '),
 ('282', 'Huxley', 'Adrian'),
 ('286', 'Hernandez', 'Marta'),
 ('293', 'Harrison', 'Ed'),
 ('298', 'Holz', 'Mihael'),
 ('299', 'Klaeboe', 'Jan'),
 ('303', 'Schuyler', 'Bradley'),
 ('307', 'Andersen', 'Mel'),
 ('311', 'Koskitalo', 'Pirkko'),
 ('314', 'Dewey', 'Catherine '),
 ('319', 'Frick', 'Steve'),
 ('320', 'Huang', 'Wing'),
 ('321', 'Brown', 'Julie'),
 ('323', 'Graham', 'Mike'),
 ('324', 'Brown', 'Ann '),
 ('328', 'Brown', 'William'),
 ('333', 'Calaghan', 'Ben'),
 ('334', 'Suominen', 'Kalle'),
 ('335', 'Cramer', 'Philip '),
 ('339', 'Cervantes', 'Francisca'),
 ('344', 'Fernandez', 'Jesus'),
 ('347', 'Chandler', 'Brian'),
 ('348', 'McKenna', 'Patricia '),
 ('350', 'Lebihan', 'Laurence '),
 ('353', 'Henriot', 'Paul '),
 ('356', 'Kuger', 'Armand'),
 ('357', 'MacKinlay', 'Wales'),
 ('361', 'Josephs', 'Karin'),
 ('362', 'Yoshido', 'Juri'),
 ('363', 'Young', 'Dorothy'),
 ('369', 'Rodriguez', 'Lino '),
 ('376', 'Urs', 'Braun'),
 ('379', 'Nelson', 'Allen'),
 ('381', 'Cartrain', 'Pascale '),
 ('382', 'Pipps', 'Georg '),
 ('385', 'Cruz', 'Arnold'),
 ('386', 'Moroni', 'Maurizio '),
 ('398', 'Shimamura', 'Akiko'),
 ('406', 'Perrier', 'Dominique'),
 ('409', 'Müller', 'Rita '),
 ('412', 'McRoy', 'Sarah'),
 ('415', 'Donnermeyer', 'Michael'),
 ('424', 'Hernandez', 'Maria'),
 ('443', 'Feuer', 'Alexander '),
 ('447', 'Lewis', 'Dan'),
 ('448', 'Larsson', 'Martha'),
 ('450', 'Frick', 'Sue'),
 ('452', 'Mendel', 'Roland '),
 ('455', 'Murphy', 'Leslie'),
 ('456', 'Choi', 'Yu'),
 ('458', 'Sommer', 'Martín '),
 ('459', 'Ottlieb', 'Sven '),
 ('462', 'Benitez', 'Violeta'),
 ('465', 'Anton', 'Carmen'),
 ('471', 'Clenahan', 'Sean'),
 ('473', 'Ricotti', 'Franco'),
 ('475', 'Thompson', 'Steve'),
 ('477', 'Moos', 'Hanna '),
 ('480', 'Semenov', 'Alexander '),
 ('481', 'Altagar,G M', 'Raanan'),
 ('484', 'Roel', 'José Pedro '),
 ('486', 'Salazar', 'Rosa'),
 ('487', 'Taylor', 'Sue'),
 ('489', 'Smith', 'Thomas '),
 ('495', 'Franco', 'Valarie'),
 ('496', 'Snowden', 'Tony')]

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [14]:
#Your code here
curr.execute('''SELECT productname, SUM(quantityordered), COUNT(ordernumber) FROM products
                JOIN orderdetails
                USING(productcode)
                GROUP BY productname''').fetchall()

[('18th Century Vintage Horse Carriage', 907, 28),
 ('18th century schooner', 1011, 27),
 ('1900s Vintage Bi-Plane', 940, 28),
 ('1900s Vintage Tri-Plane', 1009, 28),
 ('1903 Ford Model A', 883, 27),
 ('1904 Buick Runabout', 990, 27),
 ('1911 Ford Town Car', 832, 25),
 ('1912 Ford Model T Delivery Wagon', 991, 27),
 ('1913 Ford Model T Speedster', 1038, 28),
 ('1917 Grand Touring Sedan', 918, 25),
 ('1917 Maxwell Touring Car', 992, 28),
 ('1926 Ford Fire Engine', 998, 28),
 ('1928 British Royal Navy Airplane', 972, 28),
 ('1928 Ford Phaeton Deluxe', 972, 28),
 ('1928 Mercedes-Benz SSK', 880, 28),
 ('1930 Buick Marquette Phaeton', 1074, 28),
 ('1932 Alfa Romeo 8C2300 Spider Sport', 866, 25),
 ('1932 Model A Ford J-Coupe', 957, 28),
 ('1934 Ford V8 Coupe', 985, 28),
 ('1936 Chrysler Airflow', 983, 28),
 ('1936 Harley Davidson El Knucklehead', 945, 28),
 ('1936 Mercedes Benz 500k Roadster', 824, 25),
 ('1936 Mercedes-Benz 500K Special Roadster', 960, 28),
 ('1937 Horch 930V Limousine', 884, 28),
 ('1937 Lincoln Berline', 1111, 28),
 ('1938 Cadillac V-16 Presidential Limousine', 955, 28),
 ('1939 Cadillac Limousine', 995, 28),
 ('1939 Chevrolet Deluxe Coupe', 937, 28),
 ('1940 Ford Delivery Sedan', 923, 28),
 ('1940 Ford Pickup Truck', 999, 28),
 ('1940s Ford truck', 1061, 28),
 ('1941 Chevrolet Special Deluxe Cabriolet', 1076, 28),
 ('1948 Porsche 356-A Roadster', 972, 27),
 ('1948 Porsche Type 356 Roadster', 948, 25),
 ('1949 Jaguar XK 120', 949, 25),
 ("1950's Chicago Surface Lines Streetcar", 934, 27),
 ('1952 Alpine Renault 1300', 961, 28),
 ('1952 Citroen-15CV', 873, 24),
 ('1954 Greyhound Scenicruiser', 955, 28),
 ('1956 Porsche 356A Coupe', 1052, 27),
 ('1957 Chevy Pickup', 1056, 28),
 ('1957 Corvette Convertible', 1013, 27),
 ('1957 Ford Thunderbird', 767, 24),
 ('1957 Vespa GS150', 959, 27),
 ('1958 Chevy Corvette Limited Edition', 983, 28),
 ('1958 Setra Bus', 972, 28),
 ('1960 BSA Gold Star DBD34', 1015, 28),
 ('1961 Chevrolet Impala', 941, 27),
 ('1962 City of Detroit Streetcar', 966, 27),
 ('1962 LanciaA Delta 16V', 932, 28),
 ('1962 Volkswagen Microbus', 1029, 28),
 ('1964 Mercedes Tour Bus', 1053, 28),
 ('1965 Aston Martin DB5', 914, 25),
 ('1966 Shelby Cobra 427 S/C', 915, 25),
 ('1968 Dodge Charger', 925, 27),
 ('1968 Ford Mustang', 933, 27),
 ('1969 Chevrolet Camaro Z28', 870, 25),
 ('1969 Corvair Monza', 963, 27),
 ('1969 Dodge Charger', 992, 27),
 ('1969 Dodge Super Bee', 974, 27),
 ('1969 Ford Falcon', 965, 27),
 ('1969 Harley Davidson Ultimate Chopper', 1057, 28),
 ('1970 Chevy Chevelle SS 454', 803, 25),
 ('1970 Dodge Coronet', 976, 28),
 ('1970 Plymouth Hemi Cuda', 900, 27),
 ('1970 Triumph Spitfire', 945, 27),
 ('1971 Alpine Renault 1600s', 969, 27),
 ('1972 Alfa Romeo GTA', 1030, 28),
 ('1974 Ducati 350 Mk3 Desmo', 898, 27),
 ('1976 Ford Gran Torino', 915, 27),
 ('1980s Black Hawk Helicopter', 1040, 28),
 ('1980’s GM Manhattan Express', 911, 28),
 ('1982 Camaro Z28', 997, 28),
 ('1982 Ducati 900 Monster', 947, 27),
 ('1982 Ducati 996 R', 906, 27),
 ('1982 Lamborghini Diablo', 912, 27),
 ('1992 Ferrari 360 Spider red', 1808, 53),
 ('1992 Porsche Cayenne Turbo Silver', 867, 27),
 ('1993 Mazda RX-7', 947, 27),
 ('1995 Honda Civic', 917, 27),
 ('1996 Moto Guzzi 1100i', 999, 28),
 ('1996 Peterbilt 379 Stake Bed with Outrigger', 988, 28),
 ('1997 BMW F650 ST', 1014, 28),
 ('1997 BMW R 1100 S', 1033, 28),
 ('1998 Chrysler Plymouth Prowler', 986, 28),
 ('1999 Indy 500 Monte Carlo SS', 855, 25),
 ('1999 Yamaha Speed Boat', 966, 28),
 ('2001 Ferrari Enzo', 1019, 27),
 ('2002 Chevy Corvette', 894, 25),
 ('2002 Suzuki XREO', 1028, 28),
 ('2002 Yamaha YZR M1', 992, 27),
 ('2003 Harley-Davidson Eagle Drag Bike', 985, 28),
 ('ATA: B757-300', 973, 28),
 ('America West Airlines B757-200', 984, 28),
 ('American Airlines: B767-300', 894, 28),
 ('American Airlines: MD-11S', 1085, 28),
 ('Boeing X-32A JSF', 960, 28),
 ('Collectable Wooden Train', 918, 27),
 ('Corsair F4U ( Bird Cage)', 1051, 28),
 ('Diamond T620 Semi-Skirted Tanker', 979, 28),
 ('F/A 18 Hornet 1/72', 1047, 28),
 ('HMS Bounty', 897, 28),
 ('P-51-D Mustang', 917, 28),
 ('Pont Yacht', 958, 27),
 ('The Mayflower', 898, 27),
 ('The Queen Mary', 896, 27),
 ('The Schooner Bluenose', 934, 27),
 ('The Titanic', 952, 27),
 ('The USS Constitution Ship', 1020, 27)]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [9]:
#Your code here:
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products Which Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [11]:
#Your code here

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Who's Customers Have an Average Credit Limit of Over 15K

In [13]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!